{

    "unique": "extend-cbot",
    "name": "Extend cBot",
    "short_description": "Concrete support for all programmers who want to start developing cBot for cTrader, a template that will increase over time. Significantly reduces development time by eliminating reperitive operations.",
    "long_description": "<p>It has the capacity to add control of an encrypted license. Use <a href='/index.html?repository=license-generator&category=cbots'>this generator</a> for license</p>",
    "tags": ["template", "extension", "license"],
    "img_3d_box": "3d-box.png",
    "screenshots": [],
    "params": [{
            "title": "Identity",
            "content": ""
        },
        {
            "title": "Extend cBot x.x.x.",
            "content": "The name, version, and link to find references for this tool"
        },
        {
            "title": "Label (Magic Name)",
            "content": "When it opens a trade it marks it with this label"
        },
        {
            "title": "Preset information",
            "content": "Some references to the preset in use, useful if you want to specify a specific back test period"
        },
        {
            "title": "Strategy",
            "content": ""
        },
        {
            "title": "Loop Mode",
            "content": "You can choose when to process the strategy loop, in the default version OnTimer processes the event queue every second"
        },
        {
            "title": "Open Trade Type",
            "content": "The type of trade you want to open, e.g. Buy positions only"
        },
        {
            "title": "Stop Loss",
            "content": "The number of pips for the stop loss, e.g. 10 equals 10 pips"
        },
        {
            "title": "Take Profit R:R 1:?",
            "content": "The risk: reward ratio, e.g. 2 means that the take profit will be 2 times the stop loss, so if the stop loss is 10 the take profit will be 20."
        },
        {
            "title": "Close On Trigger?",
            "content": "With this option it is possible to close trades with the trigger, only those against the trigger, e.g. if we have sell and buy positions in the market when there is a new buy trigger it will only close sell positions."
        },
        {
            "title": "Use BreakEven?",
            "content": "Enables the breakeven protection check of positions, taking into consideration the parameters entered in the BreakEven section"
        },
        {
            "title": "Use Trailing?",
            "content": "Enables the trailing protection check of positions, taking into consideration the parameters entered in the Trailing section"
        },
        {
            "title": "Use Deviation Martingala? (bypass all)",
            "content": "Enables the deviation martingala, taking into consideration the parameters entered in the Deviation Martingala section, enabling this feature excludes controls for recovery positions but not triggers"
        },
        {
            "title": "Pause",
            "content": ""
        },
        {
            "title": "From (18.0 = 18:00)",
            "content": "This parameter identifies the start time of the pause, e.g. 18.0 the cBot will no longer open positions from 18:00"
        },
        {
            "title": "To (8.20 = 08:20)",
            "content": "Marks the end of the pause, e.g. 8.20 the cBot will start opening new trades from 08:20"
        },
        {
            "title": "Filters",
            "content": ""
        },
        {
            "title": "Max Spread allowed",
            "content": "Max Spread allowed : Only triggers within a certain limit are considered, e.g. 1.5 will only consider spreads equal to or less than 1.5 pips"
        },
        {
            "title": "Max GAP Allowed (pips)",
            "content": "Protects against high volatility, e.g. if the value is 1 then all trades that have a GAP greater than 1 will be ignored, GAP is the distance between the close of the previous candle and the open of the current one which must not exceed 1 pip"
        },
        {
            "title": "Max Number of Trades",
            "content": "The maximum number of trades generated by the triggers, e.g. if the value is 1 after the first trigger no more trades will be opened if there is already 1 trade in the market, no martingale deviation trades are calculated"
        },
        {
            "title": "Minimum Distance Between Trades",
            "content": "In case of multiple triggers forces a minimum distance between trades"
        },
        {
            "title": "Money Target",
            "content": ""
        },
        {
            "title": "Percentage (zero = disabled)",
            "content": "If the value of this parameter is equal to zero then no Money Target is considered, but if for example it is equal to 1 then it means that it will close all positions at the moment when the net profit reaches the value of 1% of the current balance"
        },
        {
            "title": "Minimum Trades to Activation",
            "content": "The minimum number of trades in the market before the control starts, e.g. if the value was 2 then the money target would only be controlled if there were 2 trades or more"
        },
        {
            "title": "Money Management",
            "content": ""
        },
        {
            "title": "Fixed Lots (bypass all Capital)",
            "content": "If the value of this parameter is equal to zero then it will not enter fixed lots, otherwise it will exclude any calculation, e.g. if the value was 0.02 then it will always open with 0.02 lots"
        },
        {
            "title": "Capital",
            "content": "The capital with which to do the risk calculation if Fixed Lots is zero, you can choose between Balance or Current Equity"
        },
        {
            "title": "% Risk",
            "content": "The percentage of risk to be calculated in proportion to the selected Capital"
        },
        {
            "title": "Pips To Calculate ( empty = stoploss )",
            "content": "To know how many lots to calculate we need to have the distance in pips, this value serves this purpose, if a value of zero is entered then the cBot will take into consideration the value of the stoploss, if this is also set to zero then a fictitious value of 100 pips will be considered"
        },
        {
            "title": "DrawDown",
            "content": ""
        },
        {
            "title": "% Max (zero = disabled)",
            "content": "The percentage in proportion to the Maximum Acceptable Loss Balance, if for example the value was 30 out of €1000 Balance then you would close all positions if losses exceed -€300, this is not taken into consideration if in a martingale"
        },
        {
            "title": "EMA",
            "content": ""
        },
        {
            "title": "Fast",
            "content": "The number of periods to be considered of Exponential Moving Average fast"
        },
        {
            "title": "Slow",
            "content": "The number of periods to be considered of Exponential Moving Average slow"
        },
        {
            "title": "Break Even",
            "content": ""
        },
        {
            "title": "Activation (zero = disabled)",
            "content": "If the value of this parameter is equal to zero then it is not taken into consideration even if it is enabled, it is the number of pips beyond which the control is activated, for example if it were 12 then when 12 pips are reached it moves the stoploss to entry price + the value entered in the next Distance parameter"
        },
        {
            "title": "Distance",
            "content": "The number of pips to be added to the trade's entry price"
        },
        {
            "title": "Trailing",
            "content": ""
        },
        {
            "title": "Activation (zero = disabled)",
            "content": "If the value of this parameter is equal to zero then it is not taken into consideration even if it is enabled, it is the number of pips beyond which the control is activated, for example if it were 12 then when 12 pips are reached it moves the stoploss to high price (if buy) - the value entered in the next Distance parameter and this follow the price"
        },
        {
            "title": "Distance",
            "content": "The number of pips to be added to the trade's entry price"
        },
        {
            "title": "Deviation Martingala",
            "content": ""
        },
        {
            "title": "Multiplier (zero = disabled)",
            "content": "If the value of this parameter is zero then the control will not be considered even if enabled, it is the number of times the volume of the previous trade is multiplied to create exponentiality as positions increase"
        },
        {
            "title": "Max Consecutive Loss (zero = infinite)",
            "content": "If the value of this parameter is equal to zero then it will open an unlimited number of consecutive losing trades, otherwise if it is greater than zero e.g. 3 it would mean that it will get a maximum of 3 consecutive losses"
        }
    ],
    "twitter_changelog": "ExtendCbot"
}